CAMAAR/app/controllers/admin/application_controller.rb

    def current_administrador
      @current_administrador ||= Administrador.find_by(id: session[:administrador_id])
---
SELECT "administradors".* FROM "administradors" WHERE "administradors"."id" IS NULL LIMIT 1