CAMAAR/app/controllers/admin/dashboard_controller.rb

    def index
      @total_formularios = current_administrador.formularios.count
      @total_templates = current_administrador.templates.count
---
SELECT COUNT(*) FROM "formularios" WHERE "formularios"."administrador_id" = 2
SELECT COUNT(*) FROM "templates" WHERE "templates"."administrador_id" = 2