CAMAAR/app/controllers/admin/formularios_controller.rb

INSERT INTO "formularios" ("administrador_id", "template_id", "turma_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["administrador_id", 1], ["template_id", 1], ["turma_id", 1], ["created_at", "2025-12-16 02:18:55.446923"], ["updated_at", "2025-12-16 02:18:55.446923"]]
---
    def create
      @formulario = current_administrador.formularios.new(formulario_params)
      @templates  = current_administrador.templates
      @turmas     = Turma.all.order(:semestre, :horario)

      if @formulario.save

UPDATE "formularios" SET "template_id" = ?, "turma_id" = ?, "updated_at" = ? WHERE "formularios"."id" = ?  [["template_id", 2], ["turma_id", 2], ["updated_at", "2025-12-16 02:18:55.500075"], ["id", 1]]
---
    def update
      if @formulario.update(formulario_params)

SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."formulario_id" = ?  [["formulario_id", 1]]
SELECT COUNT(DISTINCT "respostas"."aluno_id") FROM "respostas" INNER JOIN "pergunta" ON "pergunta"."id" = "respostas"."pergunta_id" WHERE "pergunta"."formulario_id" = ?  [["formulario_id", 1]]
SELECT COUNT(*) FROM "alunos" INNER JOIN "alunos_turmas" ON "alunos"."id" = "alunos_turmas"."aluno_id" WHERE "alunos_turmas"."turma_id" = ?  [["turma_id", 1]]
---
    def results
      @respostas = Resposta.joins(:pergunta)
                           .where(pergunta: { formulario_id: @formulario.id })
                           .includes(:pergunta)

      @answers_by_question = @respostas.group_by(&:pergunta)

      @total_responses = @respostas.select(:aluno_id).distinct.count
      @total_students  = @formulario.turma&.alunos&.count || 0

SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."formulario_id" = ?  [["formulario_id", 1]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."pergunta_id" = ?  [["pergunta_id", 1]]
---
    def export_csv
      perguntas = @formulario.perguntas.includes(:respostas)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."administrador_id" = ? AND "formularios"."id" = ? LIMIT ?  [["administrador_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_formulario
      @formulario = current_administrador.formularios.find(params[:id])