CAMAAR/app/controllers/admin/sessions_controller.rb

    def create
      administrador = Administrador.find_by(usuario: params[:usuario])
---
SELECT "administradors".* FROM "administradors" WHERE "administradors"."usuario" = 'admin@universidade.edu' LIMIT 1