CAMAAR/app/controllers/admin/sessions_controller.rb

SELECT "administradors".* FROM "administradors" WHERE "administradors"."usuario" = 'admin' LIMIT 1
---
    def create
      administrador = Administrador.find_by(usuario: params[:usuario])