CAMAAR/app/controllers/admin/templates_controller.rb

INSERT INTO "templates" ("administrador_id", "nome", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["administrador_id", 1], ["nome", "Test Template"], ["created_at", "2025-12-16 02:18:56.184389"], ["updated_at", "2025-12-16 02:18:56.184389"]]
---
    def create
      @template = current_administrador.templates.new(template_params)

      if @template.save

UPDATE "templates" SET "nome" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["nome", "Updated Name"], ["updated_at", "2025-12-16 02:18:56.226735"], ["id", 1]]
---
    def update
      if @template.update(template_params)

DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 1]]
---
    def destroy
      @template.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."administrador_id" = ? AND "templates"."id" = ? LIMIT ?  [["administrador_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_template
      @template = current_administrador.templates.find(params[:id])