CAMAAR/app/controllers/admin/templates_controller.rb

SELECT "templates".* FROM "templates" WHERE "templates"."administrador_id" = 2 ORDER BY "templates"."created_at" DESC
---
    def index
      @templates = current_administrador.templates
                                         .includes(:perguntas)
                                         .order(created_at: :desc)