CAMAAR/app/controllers/student/dashboard_controller.rb

    def index
      @formularios_pendentes_count = current_aluno.formularios_pendentes.count

      formularios_respondidos = Formulario.joins(perguntas: :respostas)
                                          .where(respostas: { aluno_id: current_aluno.id })
                                          .distinct
---
SELECT COUNT(DISTINCT "formularios"."id") FROM "formularios" INNER JOIN "pergunta" ON "pergunta"."formulario_id" = "formularios"."id" INNER JOIN "respostas" ON "respostas"."pergunta_id" = "pergunta"."id" WHERE "respostas"."aluno_id" = ?  [["aluno_id", 1]]
SELECT DISTINCT "formularios"."id" FROM "formularios" INNER JOIN "pergunta" ON "pergunta"."formulario_id" = "formularios"."id" INNER JOIN "respostas" ON "respostas"."pergunta_id" = "pergunta"."id" WHERE "respostas"."aluno_id" = ?  [["aluno_id", 1]]