CAMAAR/app/controllers/student/formularios_controller.rb

SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."formulario_id" = ?  [["formulario_id", 1]]
INSERT INTO "respostas" ("aluno_id", "pergunta_id", "texto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["aluno_id", 1], ["pergunta_id", 1], ["texto", "Resposta para pergunta 1"], ["created_at", "2025-12-16 02:18:55.821611"], ["updated_at", "2025-12-16 02:18:55.821611"]]
---
    def submit
      unless logged_in?
        flash[:alert] = "Sua sessão expirou. Por favor, faça login novamente."
        redirect_to login_path
        return
      end

      respostas_params = params[:respostas] || {}
      perguntas = @formulario.perguntas

      missing_answers = []
      perguntas.each do |pergunta|
        resposta_texto = respostas_params[pergunta.id.to_s]
        if resposta_texto.blank?
          missing_answers << pergunta.id

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_formulario
      @formulario = Formulario.find_by(id: params[:id])