CAMAAR/app/jobs/user_invite_job.rb

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44) AND "alunos"."registered" = 0 ORDER BY "alunos"."id" ASC LIMIT 1000
---
  def perform(user_ids)
    Rails.logger.info "UserInviteJob started with #{user_ids.inspect}"

    sent_count = 0

    if user_ids[:alunos].present?
      Aluno.where(id: user_ids[:alunos], registered: false).find_each do |aluno|