CAMAAR/app/views/templates/index.html.erb

SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 1
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 1
---
                <small class="text-muted">
                  <%= template.perguntas.count %> perguntas<br>