CAMAAR/app/services/import_json.rb

    def process_roster_entry(entry)
      new_ids = { alunos: [], professores: [] }

      code     = entry.fetch('code')
      semester = entry.fetch('semester')

      disciplina = Disciplina.find_or_initialize_by(codigo: code)
      disciplina.nome = disciplina.nome.presence || code
      disciplina.save!

      doc = entry['docente'] || {}
      professor = Professor.find_or_initialize_by(usuario: doc.fetch('usuario'))
      is_new_professor = professor.new_record?

      professor.nome         = doc['nome']
      professor.email        = doc['email']
      professor.departamento = doc['departamento']
      professor.formacao     = doc['formacao']

      if professor.password_digest.blank?
---
SELECT "professors".* FROM "professors" WHERE "professors"."usuario" = '83807519491' LIMIT 1
SELECT 1 AS one FROM "professors" WHERE "professors"."email" = 'mholanda@unb.br' AND "professors"."id" != 1 LIMIT 1

        new_ids[:professores] << professor.id
      end

      turma = Turma.find_or_initialize_by(
        disciplina: disciplina,
        professor:  professor,
        semestre:   semester
      )
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = 1 AND "turmas"."professor_id" = 1 AND "turmas"."semestre" = '2021.2' LIMIT 1

      Array(entry['dicente']).each do |st|
        matricula_normalizada = st.fetch('matricula').to_s.strip

        aluno = Aluno.find_or_initialize_by(matricula: matricula_normalizada)
---
SELECT "alunos".* FROM "alunos" WHERE "alunos"."matricula" = '190084006' LIMIT 1

          new_ids[:alunos] << aluno.id
        end

        turma.alunos << aluno unless turma.alunos.exists?(aluno.id)
---
SELECT 1 AS one FROM "alunos" INNER JOIN "alunos_turmas" ON "alunos"."id" = "alunos_turmas"."aluno_id" WHERE "alunos_turmas"."turma_id" = 1 AND "alunos"."id" = 1 LIMIT 1