CAMAAR/app/services/import_json.rb

SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = 'CIC0097' LIMIT 1
UPDATE "disciplinas" SET "nome" = 'BANCOS DE DADOS', "updated_at" = '2025-12-09 02:03:29.908222' WHERE "disciplinas"."id" = 1
---
    def process_catalog_entry(entry)
      code = entry.fetch('code')
      name = entry['name']

      disciplina = Disciplina.find_or_initialize_by(codigo: code)
      # Sua Disciplina exige nome. Se não vier, usa o existente ou fallback para o próprio código.
      disciplina.nome = name.presence || disciplina.nome || code
      disciplina.save!

SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = 'CIC0097' LIMIT 1
SELECT "professors".* FROM "professors" WHERE "professors"."usuario" = '83807519491' LIMIT 1
SELECT 1 AS one FROM "professors" WHERE "professors"."email" = 'mholanda@unb.br' AND "professors"."id" != 1 LIMIT 1
---
    def process_roster_entry(entry)
      new_ids = { alunos: [], professores: [] }

      code     = entry.fetch('code')
      semester = entry.fetch('semester')
      # classCode existe na entrada, mas sua Turma não tem essa coluna; pode ser ignorado para este fluxo.

      # Disciplina com fallback de nome (obrigatório)
      disciplina = Disciplina.find_or_initialize_by(codigo: code)
      disciplina.nome = disciplina.nome.presence || code
      disciplina.save!

      # Professor (has_secure_password): define senha dummy se necessário
      doc = entry['docente'] || {}
      professor = Professor.find_or_initialize_by(usuario: doc.fetch('usuario'))
      is_new_professor = professor.new_record?

      professor.nome         = doc['nome']
      professor.email        = doc['email']
      professor.departamento = doc['departamento']
      professor.formacao     = doc['formacao']

      if professor.password_digest.blank?

INSERT INTO "professors" ("nome", "departamento", "formacao", "usuario", "email", "ocupacao", "password_digest", "created_at", "updated_at", "registered") VALUES ('MARISTELA TERTO DE HOLANDA', 'DEPTO CIÊNCIAS DA COMPUTAÇÃO', 'DOUTORADO', '83807519491', 'mholanda@unb.br', NULL, '$2a$12$nyva95P13wmiw6p38ixDCOhs1avr2kdmRhfmyo7bdPF41DcpotKde', '2025-12-09 02:03:20.754148', '2025-12-09 02:03:20.754148', 0) RETURNING "id"
---
        professor.registered = false
      end

      professor.save!

SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = 1 AND "turmas"."professor_id" = 1 AND "turmas"."semestre" = '2021.2' LIMIT 1
INSERT INTO "turmas" ("professor_id", "disciplina_id", "formulario_id", "semestre", "horario", "created_at", "updated_at") VALUES (1, 1, NULL, '2021.2', 'N/A', '2025-12-09 02:03:20.768090', '2025-12-09 02:03:20.768090') RETURNING "id"
---
      end

      # Turma: sua model exige :semestre, :horario, :professor e :disciplina
      turma = Turma.find_or_initialize_by(
        disciplina: disciplina,
        professor:  professor,
        semestre:   semester
      )
      turma.horario = turma.horario.presence || 'N/A' # roster não traz 'time'; usamos um default
      turma.save!

SELECT "alunos".* FROM "alunos" WHERE "alunos"."matricula" = '190084006' LIMIT 1
---
        # Normalizar a matrícula (strip) para garantir a busca correta
        matricula_normalizada = st.fetch('matricula').to_s.strip

        aluno = Aluno.find_or_initialize_by(matricula: matricula_normalizada)

INSERT INTO "alunos" ("nome", "curso", "matricula", "departamento", "formacao", "usuario", "email", "ocupacao", "registered", "password_digest", "created_at", "updated_at") VALUES ('Ana Clara Jordao Perna', 'CIÊNCIA DA COMPUTAÇÃO/CIC', '190084006', 'DEPTO CIÊNCIAS DA COMPUTAÇÃO', NULL, '190084006', 'acjpjvjp@gmail.com', NULL, 0, '$2a$12$LyDA5IovFQaQJimUcwtuce5L.d1uF4dlz0JcHbiUIexsBXZNEm94u', '2025-12-09 02:03:20.940566', '2025-12-09 02:03:20.940566') RETURNING "id"
---
          aluno.registered = false
        end

        aluno.save!

SELECT 1 AS one FROM "alunos" INNER JOIN "alunos_turmas" ON "alunos"."id" = "alunos_turmas"."aluno_id" WHERE "alunos_turmas"."turma_id" = 1 AND "alunos"."id" = 1 LIMIT 1
---
          new_ids[:alunos] << aluno.id
        end

        turma.alunos << aluno unless turma.alunos.exists?(aluno.id)