CAMAAR/app/services/import_json.rb

SELECT 1 AS one FROM "disciplinas" WHERE "disciplinas"."codigo" = 'CIC0097' AND "disciplinas"."id" != 1 LIMIT 1
---
    def process_catalog_entry(entry)
      code = entry.fetch('code')
      name = entry['name']
      klass = entry['class'] || {}

      disciplina = Disciplina.find_or_initialize_by(codigo: code)
      disciplina.nome = name if name.present?

INSERT INTO "disciplinas" ("codigo", "nome", "created_at", "updated_at") VALUES ('CIC0105', 'ENGENHARIA DE SOFTWARE', '2025-12-09 02:03:29.913003', '2025-12-09 02:03:29.913003') RETURNING "id"
---
    def process_roster_entry(entry)
      code       = entry.fetch('code')
      class_code = entry.fetch('classCode')
      semester   = entry.fetch('semester')

      disciplina = Disciplina.find_or_create_by!(codigo: code)