CAMAAR/app/controllers/password_resets_controller.rb

  def create
    email = params[:email]

    # Tenta encontrar usuário (Aluno ou Professor)
    @user = Aluno.find_by(email: email) || Professor.find_by(email: email)
---
SELECT "alunos".* FROM "alunos" WHERE "alunos"."email" = 'joao.silva@exemplo.com' LIMIT 1
SELECT "professors".* FROM "professors" WHERE "professors"."email" = 'daviborges07@gmail.com' LIMIT 1