CAMAAR/app/controllers/sessions_controller.rb

  def create
    email = params[:email]
    password = params[:password]

    user = Aluno.find_by(email: email)
    user_type = 'Aluno'

    if user.nil?
      user = Professor.find_by(email: email)
---
SELECT "alunos".* FROM "alunos" WHERE "alunos"."email" = 'admin@universidade.edu' LIMIT 1
SELECT "professors".* FROM "professors" WHERE "professors"."email" = 'admin@universidade.edu' LIMIT 1