CAMAAR/app/controllers/templates_controller.rb

  def index
    if current_user.is_a?(Administrador)
      @templates = current_user.templates.includes(:perguntas).order(created_at: :desc)
---
SELECT "templates".* FROM "templates" WHERE "templates"."administrador_id" = 1 ORDER BY "templates"."created_at" DESC

  def create
    @template = Template.new(template_params)
    @template.administrador = current_user if current_user.is_a?(Administrador)

    if @template.save
---
INSERT INTO "templates" ("administrador_id", "nome", "created_at", "updated_at") VALUES (1, 'Template teste', '2025-12-07 16:14:26.606008', '2025-12-07 16:14:26.606008') RETURNING "id"

    def set_template
      @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 2 LIMIT 1