CAMAAR/app/controllers/templates_controller.rb

  def update
    if @template.update(template_params)
---
UPDATE "templates" SET "nome" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["nome", "Updated Name"], ["updated_at", "2025-12-07 16:41:51.855449"], ["id", 1]]

  def destroy
    @template.destroy
---
DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 1]]

    def set_template
      @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]