CAMAAR/app/views/admin/templates/index.html.erb

SELECT 1 AS one FROM "formularios" WHERE "formularios"."template_id" = 4 LIMIT 1
---
                    </span>
                    <% if template.formularios.any? %>