CAMAAR/app/views/admin/formularios/results.html.erb


      <% unless @formulario.alunos_respostas.any? %>
---
SELECT 1 AS one FROM "alunos" INNER JOIN "alunos_formularios" ON "alunos"."id" = "alunos_formularios"."aluno_id" WHERE "alunos_formularios"."formulario_id" = ? LIMIT ?  [["formulario_id", 1], ["LIMIT", 1]]

    <div class="stat-card">
      <div class="stat-value"><%= @formulario.perguntas.count %></div>
---
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."formulario_id" = ?  [["formulario_id", 1]]